# PropertySegmentSubcategoryId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PropertySegmentSubcategoryId Property
ParameterTypeId Class See Also
---
"Subcategory"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PropertySegmentSubcategoryId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertySegmentSubcategoryId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PropertySegmentSubcategoryId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace